heaven1925/STM32_Applications/BMS_001/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOS_CELL1_Pin GPIO_PIN_2
#define MOS_CELL1_GPIO_Port GPIOE
#define MOS_CELL2_Pin GPIO_PIN_3
#define MOS_CELL2_GPIO_Port GPIOE
#define MOS_CELL3_Pin GPIO_PIN_4
#define MOS_CELL3_GPIO_Port GPIOE
#define MOS_CELL4_Pin GPIO_PIN_5
#define MOS_CELL4_GPIO_Port GPIOE
#define MOS_CELL5_Pin GPIO_PIN_6
#define MOS_CELL5_GPIO_Port GPIOE
#define MOS_CELL6_Pin GPIO_PIN_7
#define MOS_CELL6_GPIO_Port GPIOE
#define MOS_CELL7_Pin GPIO_PIN_8
#define MOS_CELL7_GPIO_Port GPIOE
#define MOS_CELL8_Pin GPIO_PIN_9
#define MOS_CELL8_GPIO_Port GPIOE
#define MOS_CELL9_Pin GPIO_PIN_10
#define MOS_CELL9_GPIO_Port GPIOE
#define MOS_CELL10_Pin GPIO_PIN_11
#define MOS_CELL10_GPIO_Port GPIOE
#define MOS_CELL11_Pin GPIO_PIN_12
#define MOS_CELL11_GPIO_Port GPIOE
#define MOS_CELL12_Pin GPIO_PIN_13
#define MOS_CELL12_GPIO_Port GPIOE
#define MOS_CHARGE_Pin GPIO_PIN_14
#define MOS_CHARGE_GPIO_Port GPIOE
#define MOS_DISCHARGE_Pin GPIO_PIN_15
#define MOS_DISCHARGE_GPIO_Port GPIOE
#define D0_Pin GPIO_PIN_12
#define D0_GPIO_Port GPIOB
#define D1_Pin GPIO_PIN_13
#define D1_GPIO_Port GPIOB
#define D2_Pin GPIO_PIN_14
#define D2_GPIO_Port GPIOB
#define D3_Pin GPIO_PIN_15
#define D3_GPIO_Port GPIOB
#define D4_Pin GPIO_PIN_8
#define D4_GPIO_Port GPIOD
#define D5_Pin GPIO_PIN_9
#define D5_GPIO_Port GPIOD
#define D6_Pin GPIO_PIN_10
#define D6_GPIO_Port GPIOD
#define D7_Pin GPIO_PIN_12
#define D7_GPIO_Port GPIOD
#define LED1_Pin GPIO_PIN_6
#define LED1_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_7
#define LED2_GPIO_Port GPIOC
#define LED3_Pin GPIO_PIN_8
#define LED3_GPIO_Port GPIOC
#define LEDA_Pin GPIO_PIN_9
#define LEDA_GPIO_Port GPIOC
#define BUZZER_Pin GPIO_PIN_8
#define BUZZER_GPIO_Port GPIOA
#define RS_Pin GPIO_PIN_0
#define RS_GPIO_Port GPIOE
#define E_Pin GPIO_PIN_1
#define E_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
